ASL-Robot/msp430-dxl/msp430-dxl/dynamixel.c
			/* send id */
			while(!(UCA0IFG & UCTXIFG));
			UCA0TXBUF = GET_ID(packet);

			/* send packet length */
			while(!(UCA0IFG & UCTXIFG));
			UCA0TXBUF = GET_PARAM(packet) + 4;		// if ping or action, this should overflow: 0xFF + 4 = 0x03.
			while(!(UCA0IFG & UCTXIFG));
			UCA0TXBUF = 0x00;

			/* send isntruction */
			while(!(UCA0IFG & UCTXIFG));
			UCA0TXBUF = GET_INST(packet);

			switch(GET_PARAM(packet))
			{
				case 0xFF:
					while(!(UCA0IFG & UCTXIFG));
					checksum = checksum_gen(packet);
					UCA0TXBUF = XL_GET_1(checksum);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = XL_GET_2(checksum);
					break;
				case 2:
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_REG(packet);	// register to write to
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = 0x00;
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_1(packet);
					while(!(UCA0IFG & UCTXIFG));
					checksum = checksum_gen(packet);
					UCA0TXBUF = XL_GET_1(checksum);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = XL_GET_2(checksum);
					break;
				case 3:
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_REG(packet);	// register to write to
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = 0x00;
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_1(packet);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_2(packet);
					while(!(UCA0IFG & UCTXIFG));
					checksum = checksum_gen(packet);
					UCA0TXBUF = XL_GET_1(checksum);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = XL_GET_2(checksum);
					break;
				case 4:
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_REG(packet);	// register to write to
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = 0x00;
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_1(packet);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_2(packet);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_3(packet);
					while(!(UCA0IFG & UCTXIFG));
					checksum = checksum_gen(packet);
					UCA0TXBUF = XL_GET_1(checksum);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = XL_GET_2(checksum);
					break;
				case 5:
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_REG(packet);	// register to write to
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = 0x00;
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_1(packet);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_2(packet);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_3(packet);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = GET_4(packet);
					while(!(UCA0IFG & UCTXIFG));
					checksum = checksum_gen(packet);
					UCA0TXBUF = XL_GET_1(checksum);
					while(!(UCA0IFG & UCTXIFG));
					UCA0TXBUF = XL_GET_2(checksum);
					break;
			}
		}
	}

	else if (GET_ID(packet) < 0x07)
	{
		/* send start condition */
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = 0xFF;
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = 0xFF;

		/* send id */
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = GET_ID(packet);

		/* send packet length */
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = GET_PARAM(packet) + 2;

		/* send instruction type */
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = GET_INST(packet);

		switch(GET_PARAM(packet))
		{
			case 0:
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = (uint8_t)checksum_gen(packet);
				break;
			case 2:
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_REG(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_1(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = (uint8_t)checksum_gen(packet);
				break;
			case 3:
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_REG(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_1(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_2(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = (uint8_t)checksum_gen(packet);
				break;
			case 4:
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_REG(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_1(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_2(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_3(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = (uint8_t)checksum_gen(packet);
				break;
			case 5:
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_REG(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_1(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_2(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_3(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_4(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = (uint8_t)checksum_gen(packet);
				break;
		}
	}

	else
	{
		uint16_t checksum;

		/* send start condition */
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = 0xFF;
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = 0xFF;
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = 0xFD;
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = 0x00;

		/* send id */
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = GET_ID(packet);

		/* send packet length */
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = GET_PARAM(packet) + 4;		// if ping or action, this should overflow: 0xFF + 4 = 0x03.
		while(!(UCA0IFG & UCTXIFG));
		UCA0TXBUF = 0x00;

		/* send instruction */
		while(!(UCA0IFG & UCTXIFG))
		UCA0TXBUF = GET_INST(packet);

		switch(GET_PARAM(packet))
		{
			case 0xFF:
				while(!(UCA0IFG & UCTXIFG));
				checksum = checksum_gen(packet);
				UCA0TXBUF = XL_GET_1(checksum);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = XL_GET_2(checksum);
				break;
			case 2:
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_REG(packet);	// register to write to
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = 0x00;
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_1(packet);
				while(!(UCA0IFG & UCTXIFG));
				checksum = checksum_gen(packet);
				UCA0TXBUF = XL_GET_1(checksum);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = XL_GET_2(checksum);
				break;
			case 3:
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_REG(packet);	// register to write to
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = 0x00;
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_1(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_2(packet);
				while(!(UCA0IFG & UCTXIFG));
				checksum = checksum_gen(packet);
				UCA0TXBUF = XL_GET_1(checksum);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = XL_GET_2(checksum);
				break;
			case 4:
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_REG(packet);	// register to write to
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = 0x00;
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_1(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_2(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_3(packet);
				while(!(UCA0IFG & UCTXIFG));
				checksum = checksum_gen(packet);
				UCA0TXBUF = XL_GET_1(checksum);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = XL_GET_2(checksum);
				break;
			case 5:
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_REG(packet);	// register to write to
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = 0x00;
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_1(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_2(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_3(packet);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = GET_4(packet);
				while(!(UCA0IFG & UCTXIFG));
				checksum = checksum_gen(packet);
				UCA0TXBUF = XL_GET_1(checksum);
				while(!(UCA0IFG & UCTXIFG));
				UCA0TXBUF = XL_GET_2(checksum);
				break;
		}
	}
	while(UCA0STATW & UCBUSY);
	P3OUT &= ~BIT2;								// give the bus to the motor
}

uint16_t motor_read(uint64_t packet)
{
	uint64_t status = GET_ID(packet) << 56; // packet to be returned
	uint8_t i = 0, temp;
	motor_write(packet);					// ask to read

	if (GET_ID(packet) < 7)
	{
		if (GET_1(packet) == 1)					// asked to read one byte
		{
			while(i < 7)
			{
				while(!(UCA0IFG & UCRXIFG));
				temp = UCA0RXBUF;
				i++;
				switch (i)
				{
					case 5:
						SET_ERROR(status, temp);// error return
						break;
					case 6:
						SET_1(status, temp);	// parameter return
						break;
					default:
						break;					// discard
				}
			}
		}
		else if (GET_1(packet) == 2)			// asked to read two bytes
		{
			while(i < 8)
			{
				while(!(UCA0IFG & UCRXIFG));
				temp = UCA0RXBUF;
				i++;
				switch (i)
				{
					case 5:
						SET_ERROR(status, temp);// error return
						break;
					case 6:
						SET_1(status, temp);	// first parameter return
						break;
					case 7:
						SET_2(status, temp);	// second parameter return
						break;
					default:
						break;					// discard
				}
			}
		}
		else
			trap_error(0x40); 					// this should never happen.
		if (GET_ERROR(status))					// oops...
			trap_error(GET_ERROR(status));
		while(UCA0STATW & UCBUSY);				// ensure everything was received
		return status;
	}

	else
	{
		if (GET_1(packet) == 1)					// asked to read one byte
		{
			while(i < 12)
			{
				while(!(UCA0IFG & UCRXIFG));
				temp = UCA0RXBUF;
				i++;
				switch (i)
				{
					case 9:
						SET_ERROR(status, temp);// error return
						break;
					case 10:
						SET_1(status, temp);	// parameter return
						break;
					default:
						break;					// discard
				}
			}
		}
		else if (GET_1(packet) == 2)			// asked to read two bytes
		{
			while(i < 13)
			{
				while(!(UCA0IFG & UCRXIFG));
				temp = UCA0RXBUF;
				i++;
				switch (i)
				{
					case 9:
						SET_ERROR(status, temp);// error return
						break;
					case 10:
						SET_1(status, temp);	// first parameter return
						break;
					case 11:
						SET_2(status, temp);	// second parameter return
						break;
					default:
						break;					// discard
				}
			}
		}
		else
			trap_error(0x40); 					// this should never happen.
		if (GET_ERROR(status))					// oops...
			trap_error(GET_ERROR(status));
		while(UCA0STATW & UCBUSY);				// ensure everything was received
		return (uint16_t)(status & 0xFFFF);
	}
}

/* initialization APIs */
void set_id(uint8_t old_id, uint8_t new_id)
{
	uint64_t packet = 0;
	SET_ID(packet, old_id);
	SET_REG(packet, ID);
	SET_PARAM(packet, 2);
	SET_INST(packet, WRITE);
	SET_1(packet, new_id);
	motor_write(packet);
	if (old_id == 0xFE)
		motor_write(packet);
}

