ASL-Robot/msp430-dxl/msp430-dxl/dynamixel.c
void set_baud(uint8_t id, uint8_t rate)
{
	uint64_t packet = 0;
	SET_ID(packet, id);
	SET_REG(packet, BAUD);
	SET_PARAM(packet, 2);
	SET_INST(packet, WRITE);
	SET_1(packet, rate);
	motor_write(packet);
	if (id == 0xFE)
	{
		switch(rate)
		{
			case 1:
				packet &= ~(0xFF);
				SET_1(packet, 0x03);
				break;
			case 16:
				packet &= ~(0xFF);
				SET_1(packet, 0x02);
				break;
			case 34:
				packet &= ~(0xFF);
				SET_1(packet, 0x01);
				break;
			case 207:
				packet &= ~(0xFF);
				break;
		}
		motor_write(packet);
	}
}


void set_return(uint8_t id, uint8_t level)
{
	uint64_t packet = 0;
	if (id == 0xFE)
	{
		SET_ID(packet, id);
		SET_REG(packet, RETURN);
		SET_PARAM(packet, 2);
		SET_INST(packet, WRITE);
		SET_1(packet, level);
		motor_write(packet);
		packet &= 0xFF00FFFFFFFFFFFF;
		SET_REG(packet, XL_RETURN);
		motor_write(packet);
	}
	else if (id < 0x07)
	{
		SET_ID(packet, id);
		SET_REG(packet, RETURN);
		SET_PARAM(packet, 2);
		SET_INST(packet, WRITE);
		SET_1(packet, level);
		motor_write(packet);
	}
	else
	{
		SET_ID(packet, id);
		SET_REG(packet, XL_RETURN);
		SET_PARAM(packet, 2);
		SET_INST(packet, WRITE);
		SET_1(packet, level);
		motor_write(packet);
	}
}

void set_delay(uint8_t id, uint8_t delay)
{
	uint64_t packet = 0;
	SET_ID(packet, id);
	SET_REG(packet, DELAY);
	SET_PARAM(packet, 2);
	SET_INST(packet, WRITE);
	SET_1(packet, delay);
	motor_write(packet);
	if (id == 0xFE)
		motor_write(packet);
}

void normalize(uint8_t id)
{
	goal_position(id, 0x200, 0x050);
}

void torque_enable(uint8_t id)
{
	uint64_t packet = 0;
	SET_ID(packet, id);
	SET_REG(packet, ENTORQUE);
	SET_PARAM(packet, 2);
	SET_INST(packet, WRITE);
	SET_1(packet, 0x01);
	motor_write(packet);
	if (id == 0xFE)
		motor_write(packet);
}

void torque_disable(uint8_t id)
{
	uint64_t packet = 0;
	SET_ID(packet, id);
	SET_REG(packet, ENTORQUE);
	SET_PARAM(packet, 2);
	SET_INST(packet, WRITE);
	SET_1(packet, 0x00);
	motor_write(packet);
	if (id == 0xFE)
		motor_write(packet);
}

void set_torque(uint8_t id, uint16_t torque)
{
	uint64_t packet = 0;
	if (id == 0xFE)
	{
		SET_ID(packet, id);
		SET_REG(packet, TORQUE);
		SET_PARAM(packet, 3);
		SET_INST(packet, WRITE);
		SET_1(packet, GET_1(torque));
		SET_2(packet, GET_2(torque));
		motor_write(packet);
		packet &= ~(0x00FF000000000000);
		SET_REG(packet, XL_TORQUE);
		motor_write(packet);
	}
	else if (id < 0x07)
	{
		SET_ID(packet, id);
		SET_REG(packet, TORQUE);
		SET_PARAM(packet, 3);
		SET_INST(packet, WRITE);
		SET_1(packet, GET_1(torque));
		SET_2(packet, GET_2(torque));
		motor_write(packet);
	}
	else
	{
		SET_ID(packet, id);
		SET_REG(packet, XL_TORQUE);
		SET_PARAM(packet, 3);
		SET_INST(packet, WRITE);
		SET_1(packet, GET_1(torque));
		SET_2(packet, GET_2(torque));
		motor_write(packet);
	}
}

void joint_mode(uint8_t id)
{
	uint64_t packet = 0;
	if (id == 0xFE)
	{
		SET_ID(packet, id);
		SET_REG(packet, CW);
		SET_PARAM(packet, 5);
		SET_INST(packet, WRITE);
		SET_1(packet, 0x01);
		SET_3(packet, 0xFF);
		SET_4(packet, 0x03);
		motor_write(packet);
		packet &= ~(0x00FFFF00FFFFFFFF);
		SET_REG(packet, CONTROL);
		SET_PARAM(packet, 2);
		SET_1(packet, 2);
		motor_write(packet);
	}
	else if (id < 0x07)
	{
		SET_ID(packet, id);
		SET_REG(packet, CW);
		SET_PARAM(packet, 5);
		SET_INST(packet, WRITE);
		SET_1(packet, 0x01);
		SET_3(packet, 0xFF);
		SET_4(packet, 0x03);
		motor_write(packet);
	}
	else
	{
		SET_ID(packet, id);
		SET_REG(packet, CONTROL);
		SET_PARAM(packet, 2);
		SET_INST(packet, WRITE);
		SET_1(packet, 2);
		motor_write(packet);
	}
}

uint8_t ping(uint8_t id)
{
	uint64_t packet = 0;
	if (id == 0xFE)
		trap_error(0x40);
	else if (id < 0x07)
	{
		SET_ID(packet, id);
		SET_INST(packet, PING);
	}
	else
	{
		SET_ID(packet, id);
		SET_INST(packet, PING);
		SET_PARAM(packet, 0xFF);
	}
	if (GET_ID(motor_read(packet)) == id)
		return 1;
	return 0;
}

void led_on(uint8_t id)
{
	uint64_t packet = 0;
	SET_ID(packet, id);
	SET_REG(packet, LED);
	SET_PARAM(packet, 2);
	SET_INST(packet, WRITE);
	SET_1(packet, 0x01);
	motor_write(packet);
	if (id == 0xFE)
		motor_write(packet);
}

void led_off(uint8_t id)
{
	uint64_t packet = 0;
	SET_ID(packet, id);
	SET_REG(packet, LED);
	SET_PARAM(packet, 2);
	SET_INST(packet, WRITE);
	SET_1(packet, 0x00);
	motor_write(packet);
	if (id == 0xFE)
		motor_write(packet);
}

/* performance APIs */
void goal_position(uint8_t id, uint16_t position, uint16_t speed)
{
	uint64_t packet = 0;
	SET_ID(packet, id);
	SET_REG(packet, GOAL_POS);
	SET_PARAM(packet, 5);
	SET_INST(packet, WRITE);
	SET_1(packet, GET_1(position));
	SET_2(packet, GET_2(position));
	SET_3(packet, GET_1(speed));
	SET_4(packet, GET_2(speed));
	motor_write(packet);
	if (id == 0xFE)
		motor_write(packet);
}

uint16_t curr_position(uint8_t id)
{
	uint64_t packet = 0;
	if (id == 0xFE)
		trap_error(0x40); 			// NOT SUPPOSED TO HAPPEN!
	else if (id < 0x07)
	{
		SET_ID(packet, id);
		SET_REG(packet, CURR_POS);
		SET_PARAM(packet, 2);
		SET_INST(packet, READ);
		SET_1(packet, 0x02);
		return motor_read(packet);
	}
	else
	{
		SET_ID(packet, id);
		SET_REG(packet, XL_CURR_POS);
		SET_PARAM(packet, 3);
		SET_INST(packet, READ);
		SET_1(packet, 0x02);
		return motor_read(packet);
	}
	return 0;
}

void register_goal_position(uint8_t id, uint16_t position, uint16_t speed)
{
	uint64_t packet = 0;
	SET_ID(packet, id);
	SET_REG(packet, GOAL_POS);
	SET_PARAM(packet, 5);
	SET_INST(packet, REG_WRITE);
	SET_1(packet, GET_1(position));
	SET_2(packet, GET_2(position));
	SET_3(packet, GET_1(speed));
	SET_4(packet, GET_2(speed));
	motor_write(packet);
	if (id == 0xFE)
		motor_write(packet);
}

void action(uint8_t id)
{
	uint64_t packet = 0;
	if (id == 0xFE)
		trap_error(0x40);
	else if (id < 0x07)
	{
		SET_ID(packet, id);
		SET_INST(packet, ACTION);
	}
	else
	{
		SET_ID(packet, id);
		SET_INST(packet, PING);
		SET_PARAM(packet, 0xFF);
	}
	motor_write(packet);
	if (id == 0xFE)
		motor_write(packet);
}

/* error handling */
void trap_error(uint8_t error)
{
	/* AHHH WHY DID WE EVEN GET HERE?!
	 *
	 * brian, at this point you should observe the error code
	 * and find out why you got here.
	 * ideally, you'd want to send the error code back to the SBC.
	 */
	__bis_SR_register(LPM4_bits);			// no tears now, only dreams...
}
